////////////////////////////////////////////////
// © https://github.com/badhitman - @FakeGov 
////////////////////////////////////////////////

namespace SharedLib;

/// <summary>
/// Состояние элемента касательно возможности его сдвинуть (выше/ниже)
/// </summary>
/// <remarks>
/// Для организации перемещения/сдвига строк в таблицах/списках
/// </remarks>
public enum MoveRowStatesEnum
{
    /// <summary>
    /// Элемент единственный в перечне
    /// </summary>
    Singleton,

    /// <summary>
    /// Элемент находится где-то между элементами и не занимает ни одно из крайних положений
    /// </summary>
    Between,

    /// <summary>
    /// Элемент первый в перечне (в начале) - находится в крайнем положении
    /// </summary>
    Start,

    /// <summary>
    /// Элемент последний в перечне (в конце) - находится в крайнем положении
    /// </summary>
    End
}